Revit 2026 API

# WoodWoodColor1 Property

---

The property labeled "Color 1" from the "Wood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WoodColor1 { get; }
```
```vb
Public Shared ReadOnly Property WoodColor1 As String
	Get
```
```cpp
public:
static property String^ WoodColor1 {
	String^ get ();
}
```
```fsharp
static member WoodColor1 : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

Wood Class

Autodesk.Revit.DB.Visual Namespace